using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace Classwork20200415_Event_Planning
{
    static class Program
    {
        /// <summary>
        /// Главная точка входа для приложения.
        /// </summary>
        [STAThread]
        static void Main()
        {
            Application.EnableVisualStyles();
            Application.SetCompatibleTextRenderingDefault(false);
            Application.Run(new Form1());
        }
        /*Створити програму "Планування подій(справ) 2.0".

      На головній формі розмістити 

 	//////////////////// - текстове поле для введення назви події(справи)

	/////////////////////- DateTimePicker або MonthCalendar для вибору дати події

	/////////////////////- тристановий прапорець(CheckBox) для вибору пріорітету події(високий, середній, низький)

	- кнопку Додати, що додає відповідну подію у  listbox( бажано, щоб події впорядковувалися по даті)
	
	- кнопку очищення списку подій

	///////////////////////- кнопку для видалення виділених подій у списку подій

	- кнопку для  пошуку події у списку за назвою(переміщати курсор на подію у списку: SetSelected(int index,bool value)
	
	- кнопку для  редагування події(якщо обрано декілька - редагувати першу). При натисненні на кнопці Редагувати форма 
        	збільшується у розмірі або(і) зявляється група з елементів для редагування(GroupBox, Panel).
		Дозволяти редагувати назву події, дату події, пріоритет.
	  
	- кнопку збереження плану подій у текстовому файлі(xml краще) з назвою, що містить поточну дату.

      ////////////////////Зауваження. Не дозволяти планування на "вчора"
         */
    }
}
