using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace Classwork20200511_TreeView
{
    static class Program
    {
        /// <summary>
        /// Главная точка входа для приложения.
        /// </summary>
        [STAThread]
        static void Main()
        {
            Application.EnableVisualStyles();
            Application.SetCompatibleTextRenderingDefault(false);
            Application.Run(new Form1());
        }
    }


    /* =====================================================================================
     ListView.
_____Права частина Провідника_____________
Створити програму, яка дозволить обирати папку( FolderBrowserDialog) і буде відображувати вміст папки(файли та підпапки)  подібно програмі Провідник. 

//////////////////////////// Передбачити можливість зміни способу перегляду списку файлів (список, деталі, малі значки, великі значки).
//////////////////////////// Передбачити можливість впорядкувувати по 
		//////////////////// по іменах		
		по розміру 
		//////////////////// по даті

//////////////////////////// При виборі у ListView нової папки(подвійний клік) поновлювати список файлів(папок) з обраної папки.

//////////////////////////// При виділенні мишею певного елемента(файлу чи папки) у рядку стану показувати інформацію про файл(папку)

* При натисненні  клавіші Del - видаляти виділені файли та папки при підтвердженні видалення
* При натисненні  клавіші BackSpace - повертатися назад*/

    //=======================================================================================

    /*Створити форму.
На формі - Меню.
В меню - 2 пункти:
Browse - при клікові відкривається FolderBrowseDialog. Обираємо каталог - всі папки з нього відображуються в TreeView
View - при клікові встановлюється режим перегляду ListView

В робочій області форми - зліва TreeView
Справа - ListView
Після розгортання вузлів TreeView отримуємо дочірні вузли - підпапки обраного каталога
При виборі певного вузла (DoubleClick) - в ListView бачимо вміст даного каталога у вигляді ListViewItem-s 
(вигляд Item-a придумати:  іконка для папки, іконка для файла, назва...)*/
}
