using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace Classwork20200504_Telephone_Directory
{
    static class Program
    {
        /// <summary>
        /// Главная точка входа для приложения.
        /// </summary>
        [STAThread]
        static void Main()
        {
            Application.EnableVisualStyles();
            Application.SetCompatibleTextRenderingDefault(false);
            Application.Run(new Parent());
        }
    }
}

/*
 "Телефонний довідник"

Є дві форми. Одна батьківська, інша дочірня
На першій показати список контактів (ListBox)
Кнопки:
Додати контакт
Редагувати
Видалити - видаляє вибраний елемент із лістбокса
Очистити все - очищає лістбокс

Коли натискаємо кнопку "Додати контакт" - з'являється дочірня форма з двома полями для вводу (textBox) імені та номеру телефона
Також є кнопка Додати
По клікові на конопку додати, з полів "збирається" об'єкт Contact, та додається в список контактів на батьківській формі

При виборі кнопки "Редагувати контакт" - відкривається форма (та сама, що і при додаванні),
 але вибраний контакт в лістбоксі має показатись в відповідних текстових полях дочірньої форми. Кнопка на формі набуває вигляд "Змінити"
Якщо були зміни - контакт має змінитись у відповідному item лістбокса на батьківській формі.
Якщо поля змінились, але користувач закрив дочірню форму - лістбокс на формі не змінюється

Передбачити наступні моменти:
- Можна редагувати та видаляти тільки вибраний елемент в лістбоксі
- поле для номеру не може містити літери та інші символи не по формату номера
- поле "Ім'я" не може бути порожнім
 */
